# Написати програму котра зможе за допомогою регулярного виразу вказати які
# номера телефонів вірні, а які ні.
# 	Вимоги до валідного номера телефона:
# 1. він може починатися як зі знаків «+38» або «38», так й без них. Ці знаки
# можуть бути як у скобках, так і без них.
# 2. далі може бути пробіл або тире, або одразу йти наступні цифри
# 3. потім йде номер оператора з трьох цифр. Перша цифра обов'язково «0»,
# потім може бути одна з цифр 5, 6, або 9 і потім може бути будьяка цифра.
# Таким чином номером оператора може бути: 056, 096, 050, 067, 098, 051, 063
# 4. далі може бути пробіл або тире, або одразу йти наступні цифри
# 5. потім йде 3 будьякі цифри
# 6. далі може бути пробіл або тире, або одразу йти наступні цифри
# 7. потім йде 2 будьякі цифри
# 8. далі може бути пробіл або тире, або одразу йти наступні цифри
# 9. потім йде 2 будьякі цифри
# 	Після останніх двох цифр не може бути ніяких цифр чи знаків. Якщо номер
# коректний, але крім коректного номеру йде ще цифра, чи декілька цифр – тоді
# увесь цей номер не коректний.
# 	Таким чином, у тестовому кортежу номерів:
# phone_numbers = ('0964567654', '380976787654', '+380506780098',
# '096-456-76-54', '096 456 76 54', '(+38)0506780098', '44555', '196 4567654',
# '9964567654', '0864567654', '480976787654', '361976787654', '09645676544',
# '380976787654456', '+0964567654')
#
# перші 6 номерів є валідними й ваш код повинен для цих номерів видати напис,
# наприклад: Number "+38 0506780098" is correct
# Останні 9 номерів є не валідними й  ваш код повинен для цих номерів видати
# напис, наприклад: Number "09645676544" is not correct

phone_numbers = (
    '0964567654', '380976787654', '+380506780098', '096-456-76-54',
    '096 456 76 54', '(+38)0506780098', '44555', '196 4567654',
    '9964567654', '0864567654', '480976787654', '361976787654',
    '09645676544', '380976787654456', '+0964567654'
)
